In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find the data files in the README.

In [2]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [4]:
#using groupby(), count the number of films that have been released in each decade in the history of cinema.
titles['decade'] = titles['year'] // 10 * 10
titles.groupby('decade').size()

decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
dtype: int64

### Use groupby() count the number of "Hamlet" films made in each decade.

In [5]:
#Using groupby(), count the number of "Hamlet" films made in each decade.
hamlet = titles[titles.title == 'Hamlet']
hamlet.groupby('decade').size()

decade
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [6]:
#How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?
c = cast[(cast.year // 10 == 195) & (cast.n == 1)]
c.groupby(['year', 'type']).size()

year  type
1950  actor      626
      actress    281
1951  actor      647
      actress    281
1952  actor      607
      actress    293
1953  actor      652
      actress    301
1954  actor      634
      actress    310
1955  actor      641
      actress    281
1956  actor      643
      actress    305
1957  actor      735
      actress    301
1958  actor      710
      actress    295
1959  actor      721
      actress    317
dtype: int64

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [7]:
#In the 1950s decade taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?
c = cast[(cast.year // 10 == 195) & (cast.n <= 5)]
c.groupby(['n', 'type']).size().unstack('type')

type  actor  actress
n
1.0    6616     2965
2.0    4564     4556
3.0    5587     3148
4.0    5594     2849
5.0    5611     2544

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [8]:
#Use groupby() to determine how many roles are listed for each of the Pink Panther movies.
c = cast[cast.title == 'The Pink Panther']
c.groupby(['year']).size()

year
1963    21
2006    90
dtype: int64

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [9]:
#List, in order by year, each of the films in which Frank Oz has played more than 1 role.
c = cast[cast.name == 'Frank Oz']
g = c.groupby(['year', 'title']).size()
g[g > 1]

year  title
1979  The Muppet Movie                        8
1981  An American Werewolf in London          2
      The Great Muppet Caper                  6
1982  The Dark Crystal                        2
1984  The Muppets Take Manhattan              7
1985  Follow That Bird                        3
1992  The Muppet Christmas Carol              7
1996  Muppet Treasure Island                  4
1999  Muppets from Space                      4
      The Adventures of Elmo in Grouchland    3
dtype: int64

### List each of the characters that Frank Oz has portrayed at least twice.

In [10]:
#List each of the characters that Frank Oz has portrayed at least twice.
c = cast[cast.name == 'Frank Oz']
g = c.groupby(['character']).size()
g[g > 1].sort_values(ascending=False)

character
Animal            6
Miss Piggy        6
Yoda              6
Sam the Eagle     5
Fozzie Bear       4
Bert              3
Cookie Monster    3
Grover            2
dtype: int64